openwch/wch-usb-driver/chips/ch32v205/sdk/Peripheral/src/ch32v205_usart.c
/********************************** (C) COPYRIGHT *******************************
 * File Name          : ch32v205_usart.c
 * Author             : WCH
 * Version            : V1.0.1
 * Date               : 2025/08/28
 * Description        : This file provides all the USART firmware functions.
 *********************************************************************************
 * Copyright (c) 2021 Nanjing Qinheng Microelectronics Co., Ltd.
 * Attention: This software (modified or not) and binary are used for
 * microcontroller manufactured by Nanjing Qinheng Microelectronics.
 *******************************************************************************/
#include "ch32v205_usart.h"
#include "ch32v205_rcc.h"

/* USART_Private_Defines */
#define CTLR1_UE_Set              ((uint16_t)0x2000) /* USART Enable Mask */
#define CTLR1_UE_Reset            ((uint16_t)0xDFFF) /* USART Disable Mask */

#define CTLR1_WAKE_Mask           ((uint16_t)0xF7FF) /* USART WakeUp Method Mask */

#define CTLR1_RWU_Set             ((uint16_t)0x0002) /* USART mute mode Enable Mask */
#define CTLR1_RWU_Reset           ((uint16_t)0xFFFD) /* USART mute mode Enable Mask */
#define CTLR1_SBK_Set             ((uint16_t)0x0001) /* USART Break Character send Mask */
#define CTLR1_CLEAR_Mask          ((uint16_t)0xE9F3) /* USART CTLR1 Mask */
#define CTLR2_Address_Mask        ((uint16_t)0xFFF0) /* USART address Mask */

#define CTLR2_LINEN_Set           ((uint16_t)0x4000) /* USART LIN Enable Mask */
#define CTLR2_LINEN_Reset         ((uint16_t)0xBFFF) /* USART LIN Disable Mask */

#define CTLR2_LBDL_Mask           ((uint16_t)0xFFDF) /* USART LIN Break detection Mask */
#define CTLR2_STOP_CLEAR_Mask     ((uint16_t)0xCFFF) /* USART CTLR2 STOP Bits Mask */
#define CTLR2_CLOCK_CLEAR_Mask    ((uint16_t)0xF0FF) /* USART CTLR2 Clock Mask */

#define CTLR3_SCEN_Set            ((uint16_t)0x0020) /* USART SC Enable Mask */
#define CTLR3_SCEN_Reset          ((uint16_t)0xFFDF) /* USART SC Disable Mask */

#define CTLR3_NACK_Set            ((uint16_t)0x0010) /* USART SC NACK Enable Mask */
#define CTLR3_NACK_Reset          ((uint16_t)0xFFEF) /* USART SC NACK Disable Mask */

#define CTLR3_HDSEL_Set           ((uint16_t)0x0008) /* USART Half-Duplex Enable Mask */
#define CTLR3_HDSEL_Reset         ((uint16_t)0xFFF7) /* USART Half-Duplex Disable Mask */

#define CTLR3_IRLP_Mask           ((uint16_t)0xFFFB) /* USART IrDA LowPower mode Mask */
#define CTLR3_CLEAR_Mask          ((uint16_t)0xFCFF) /* USART CTLR3 Mask */

#define CTLR3_IREN_Set            ((uint16_t)0x0002) /* USART IrDA Enable Mask */
#define CTLR3_IREN_Reset          ((uint16_t)0xFFFD) /* USART IrDA Disable Mask */
#define GPR_LSB_Mask              ((uint16_t)0x00FF) /* Guard Time Register LSB Mask */
#define GPR_MSB_Mask              ((uint16_t)0xFF00) /* Guard Time Register MSB Mask */
#define IT_Mask                   ((uint16_t)0x001F) /* USART Interrupt Mask */

/* USART OverSampling-8 Mask */
#define CTLR1_OVER8_Set           ((uint16_t)0x8000) /* USART OVER8 mode Enable Mask */
#define CTLR1_OVER8_Reset         ((uint16_t)0x7FFF) /* USART OVER8 mode Disable Mask */

/* USART One Bit Sampling Mask */
#define CTLR3_ONEBITE_Set         ((uint16_t)0x0800) /* USART ONEBITE mode Enable Mask */
#define CTLR3_ONEBITE_Reset       ((uint16_t)0xF7FF) /* USART ONEBITE mode Disable Mask */

/*********************************************************************
 * @fn      USART_DeInit
 *
 * @brief   Deinitializes the USARTx peripheral registers to their default
 *        reset values.
 *
 * @param   USARTx - where x can be (1~8) to select the UART peripheral.
 *
 * @return  none
 */
void USART_DeInit(USART_TypeDef *USARTx)
{
    if(USARTx == USART1)
    {
        RCC_PB2PeriphResetCmd(RCC_PB2Periph_USART1, ENABLE);
        RCC_PB2PeriphResetCmd(RCC_PB2Periph_USART1, DISABLE);
    }
    else if(USARTx == USART2)
    {
        RCC_PB1PeriphResetCmd(RCC_PB1Periph_USART2, ENABLE);
        RCC_PB1PeriphResetCmd(RCC_PB1Periph_USART2, DISABLE);
    }
    else if(USARTx == USART3)
    {
        RCC_PB1PeriphResetCmd(RCC_PB1Periph_USART3, ENABLE);
        RCC_PB1PeriphResetCmd(RCC_PB1Periph_USART3, DISABLE);
    }
    else if(USARTx == USART4)
    {
        RCC_PB1PeriphResetCmd(RCC_PB1Periph_USART4, ENABLE);
        RCC_PB1PeriphResetCmd(RCC_PB1Periph_USART4, DISABLE);
    }
    else if(USARTx == USART5)
    {
        RCC_PB1PeriphResetCmd(RCC_PB1Periph_USART5, ENABLE);
        RCC_PB1PeriphResetCmd(RCC_PB1Periph_USART5, DISABLE);
    }
    else if(USARTx == USART6)
    {
        RCC_PB1PeriphResetCmd(RCC_PB1Periph_USART6, ENABLE);
        RCC_PB1PeriphResetCmd(RCC_PB1Periph_USART6, DISABLE);
    }
    else if(USARTx == USART7)
    {
        RCC_PB1PeriphResetCmd(RCC_PB1Periph_USART7, ENABLE);
        RCC_PB1PeriphResetCmd(RCC_PB1Periph_USART7, DISABLE);
    }
    else if(USARTx == USART8)
    {
        RCC_PB1PeriphResetCmd(RCC_PB1Periph_USART8, ENABLE);
        RCC_PB1PeriphResetCmd(RCC_PB1Periph_USART8, DISABLE);
    }
}

/*********************************************************************
 * @fn      USART_Init
 *
 * @brief   Initializes the USARTx peripheral according to the specified
 *        parameters in the USART_InitStruct.
 *
 * @param   USARTx - where x can be (1~8) to select the UART peripheral.
 *          USART_InitStruct - pointer to a USART_InitTypeDef structure
 *        that contains the configuration information for the specified
 *        USART peripheral.
 *
 * @return  none
 */
void USART_Init(USART_TypeDef *USARTx, USART_InitTypeDef *USART_InitStruct)
{
    uint32_t          tmpreg            = 0x00;
    uint32_t          integerdivider    = 0x00;
    uint32_t          fractionaldivider = 0x00;
    uint32_t          usartxbase        = 0;
    RCC_ClocksTypeDef RCC_ClocksStatus;
    uint64_t          PBclock = 0x00;

    usartxbase = (uint32_t)USARTx;
    tmpreg     = USARTx->CTLR2;
    tmpreg &= CTLR2_STOP_CLEAR_Mask;
    tmpreg |= (uint32_t)USART_InitStruct->USART_StopBits;

